{
    "about.backend.title": "Desarrollo Backend",
    "about.backend.description": "Construyendo aplicaciones robustas del lado del servidor con Node.js, Express y APIs REST seguras.",
    "about.frontend.title": "Desarrollo Frontend",
    "about.frontend.description": "Creando aplicaciones web modernas y responsivas usando React, Next.js y TypeScript.",
    "about.database.title": "Gestión de Bases de Datos",
    "about.database.description": "Diseñando e implementando soluciones eficientes de bases de datos con MongoDB y SQL.",
    "about.techstack": "Mi Stack Tecnológico",
    "home": "Inicio",
    "about": "Sobre mí",
    "projects": "Proyectos",
    "contact": "Contacto",
    "hi message": "Hola soy Emanuel, Desarrollador de Software.",
    "subtitle message": "Construyo experiencias digitales elegantes y de alta calidad a través del código. Mi enfoque está en crear interfaces intuitivas. Cada proyecto es una oportunidad para combinar creatividad con precisión.",
    "about title": "Sobre mí",
    "about me": "Soy un Desarrollador de Software Junior apasionado por explorar el mundo de la programación. Tengo experiencia práctica en la creación de aplicaciones web con tecnologías modernas y disfruto diseñando soluciones eficientes y escalables que generan un impacto real. Mi objetivo es seguir aprendiendo y creciendo mientras desarrollo software que mejore la vida de las personas.",
    "view my work": "Ver mi trabajo",
    "get in touch": "Contáctame",
    "card 1": "Código Limpio",
    "card 1 text": "Escribo código limpio y mantenible, siguiendo las mejores prácticas para asegurar el éxito a largo plazo de los proyectos.",
    "card 2": "Diseño UI/UX",
    "card 2 text": "Creo interfaces hermosas e intuitivas que los usuarios disfrutan utilizar.",
    "card 3": "Rendimiento",
    "card 3 text": "Optimizo aplicaciones para lograr velocidad y eficiencia, ofreciendo una experiencia de usuario fluida.",
    "technologies": "Tecnologías con las que trabajo",
    "footer text": "© 2025 Emanuel Gaviria. Todos los derechos reservados.",
    "projects title": "Proyectos Destacados",
    "projects paragraph": "Aquí tienes algunos de los proyectos en los que he trabajado recientemente. Haz clic en cualquiera para saber más.",
    "projects 1 title": "TechNova",
    "projects 1 description": "TechNova es una plataforma de comercio electrónico diseñada para vender productos tecnológicos, electrónicos y accesorios. Proporciona una experiencia de compra donde los usuarios pueden navegar a través de.",
    "projects 2 title": "ABookalypse",
    "projects 2 description": "ABookalypse es un sistema de gestión de bibliotecas digitales diseñado para ayudar a los usuarios a llevar un registro de los libros, gestionar préstamos y devoluciones, y organizar el inventario general de una biblioteca.",
    "projects 3 title": "ChatWebSocket",
    "projects 3 description": "Chat WebSocket es una plataforma de mensajería en tiempo real que utiliza WebSockets para establecer una comunicación bidireccional persistente entre los usuarios y el servidor.",
    "contact title": "Trabajemos Juntos",
    "contact paragraph": "Siempre me entusiasma conocer nuevas ideas, proyectos y oportunidades de colaboración. ¡No dudes en ponerte en contacto!",
    "form text": "Completa el siguiente formulario y te responderé lo antes posible.",
    "form.validation.required": "Por favor ingresa nombre y correo.",
    "form.validation.name_length": "El nombre debe tener al menos 4 caracteres.",
    "form.validation.email_invalid": "Ingresa un correo válido.",
    "form.sending": "Enviando...",
    "form.success": "Gracias — tu mensaje fue enviado.",
    "form.error": "Error enviando el formulario.",
    "form.client_exists": "El cliente ya existe.",
    "form.server_error": "Error del servidor.",
    "name": "Tu Nombre",
    "email": "Tu Correo Electrónico",
    "message": "Tu Mensaje",
    "button message": "Enviar Mensaje"
}
