{
    "home": "Inicio",
    "about": "Sobre mí",
    "projects": "Proyectos",
    "contact": "Contacto",
    "hi message": "Hola, soy Emanuel, Desarrollador de Software. Construyo experiencias digitales elegantes y de alta calidad a través del código.",
    "about title": "Sobre mí",
    "about me": "Soy un Desarrollador de Software Junior apasionado por explorar el mundo de la programación. Tengo experiencia práctica en la creación de aplicaciones web con tecnologías modernas y disfruto diseñando soluciones eficientes y escalables que generan un impacto real. Mi objetivo es seguir aprendiendo y creciendo mientras desarrollo software que mejore la vida de las personas.",
    "view my work": "Ver mi trabajo",
    "get in touch": "Contáctame",
    "card 1": "Código Limpio",
    "card 1 text": "Escribo código limpio y mantenible, siguiendo las mejores prácticas para asegurar el éxito a largo plazo de los proyectos.",
    "card 2": "Diseño UI/UX",
    "card 2 text": "Creo interfaces hermosas e intuitivas que los usuarios disfrutan utilizar.",
    "card 3": "Rendimiento",
    "card 3 text": "Optimizo aplicaciones para lograr velocidad y eficiencia, ofreciendo una experiencia de usuario fluida.",
    "technologies": "Tecnologías con las que trabajo",
    "footer text": "© 2025 Emanuel Gaviria. Todos los derechos reservados.",
    "projects title": "Proyectos Destacados",
    "projects paragraph": "Aquí tienes algunos de los proyectos en los que he trabajado recientemente. Haz clic en cualquiera para saber más.",
    "projects 1 title": "----------------",
    "projects 1 description": "----------------",
    "projects 2 title": "----------------",
    "projects 2 description": "----------------",
    "projects 3 title": "----------------",
    "projects 3 description": "----------------",
    "contact title": "Trabajemos Juntos",
    "contact paragraph": "Siempre me entusiasma conocer nuevas ideas, proyectos y oportunidades de colaboración. ¡No dudes en ponerte en contacto!",
    "form text": "Completa el siguiente formulario y te responderé lo antes posible.",
    "name": "Tu Nombre",
    "email": "Tu Correo Electrónico",
    "message": "Tu Mensaje",
    "button message": "Enviar Mensaje"
}
